app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        begin
            @article = Article.find(params[:id])
            @user = User.find(@article.user_id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def new
        if current_user != User.find_by(id: params[:user_id])

INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "uifhsdgiaua"], ["content", "fsdhasdfrhadsfh"], ["created_at", "2025-03-28 08:51:10.896436"], ["updated_at", "2025-03-28 08:51:10.896436"], ["user_id", 1]]
---
    def create
        @article = Article.new(create_params)
        if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        begin
            @article = Article.find(params[:id])
            user = User.find(@article.user_id)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Unnnnamed"], ["content", "Hatred"], ["updated_at", "2025-03-28 10:44:49.646797"], ["id", 4]]
---
    def update
        @article = Article.find(params[:id])
        if @article.update(article_params)