app/controllers/users_controller.rb

    def show
        begin
            @user = User.find(params[:id])
            @article = Article.where("user_id = ?",params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE (user_id = '1')

    def destroy
        user = User.find(params[:id])
        #if current_user != user
         #   sign_out current_user
         #   redirect_to new_user_session_path
         #   return
        #end
        user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]